============================================
Identifiers
============================================
foo
foo2
foo.bar
.foo.bar
foo_bar
`a "literal"`
`another
literal \` foo`

# 0foo not working for now
_foo


----

(program
 (identifier)
 (identifier)
 (identifier)
 (identifier)
 (identifier)
 (identifier)
 (identifier (escape_sequence))
 (comment)
 (ERROR (UNEXPECTED '_')))

============================================
Strings
============================================

"foo"
"foo\"bar"
'foo'
'foo\'bar'

----

(program
 (string)
 (string (escape_sequence))
 (string)
 (string (escape_sequence)))

============================================
Comments
============================================

# a comment' 

'# not a comment'


'
# still not a comment'

---

(program
 (comment)
 (string)
 (string))

========
Integers
========

12332
0
12L

---

(program
  (integer)
  (integer)
  (integer))

========
Constants
========

TRUE
FALSE
NULL
Inf
NaN
NA
NA_real_
NA_character_
NA_complex_

---

(program
  (true)
  (false)
  (null)
  (inf)
  (nan)
  (na)
  (na)
  (na)
  (na))
