=====================================
Subscript expressions
=====================================

a[1]
a[2, 3]
a[4, 5,]

---

(module
  (expression_statement (subscript (identifier) (number)))
  (expression_statement (subscript (identifier) (number) (number)))
  (expression_statement (subscript (identifier) (number) (number))))

=====================================
Call expressions
=====================================

a(1)
c(e, f=g, h)
i(j, 5,)

---

(module
  (expression_statement (call
    (identifier)
    (number)))
  (expression_statement (call
    (identifier)
    (identifier)
    (keyword_argument (identifier) (identifier))
    (identifier)))
  (expression_statement (call (identifier) (identifier) (number))))

=====================================
Calls with splats
=====================================

a(*b)
c(d, *e, f, **g)

---

(module
  (expression_statement (call
    (identifier)
    (list_splat_argument (identifier))))
  (expression_statement (call
    (identifier)
    (identifier)
    (list_splat_argument (identifier))
    (identifier)
    (dictionary_splat_argument (identifier)))))

=====================================
Math operators
=====================================

a + b * c ** d - e / 5

---

(module
  (expression_statement
    (binary_operator
      (binary_operator
        (identifier)
        (binary_operator
          (identifier)
          (binary_operator
            (identifier)
            (identifier))))
      (binary_operator
        (identifier)
        (number)))))
