======
symbol
======

:foo

---

(program (symbol))

================
scope resolution
================

Foo::bar

---

(program (scope_resolution_expression (identifier) (identifier)))

============
subscripting
============

foo[bar]

---

(program (subscript_expression (identifier) (identifier)))

===============
vacuous literal
===============

()

---

(program)

===================
yield without value
===================

yield

---

(program (yield))

=====
yield
=====

yield foo

---

(program (yield (identifier)))
