=====================================
Lists
=====================================

[a, b, [c, d]]

---

(module
  (expression_statement (list
    (identifier)
    (identifier)
    (list
      (identifier)
      (identifier)))))

=====================================
List comprehensions
=====================================

[a + b for a, b in items]

---

(module
  (expression_statement (list_comprehension
    (binary_operator
      (identifier)
      (identifier))
    (expression_list
      (identifier)
      (identifier))
    (identifier))))

=====================================
Dictionaries
=====================================

{a: 1, b: 2}

---

(module
  (expression_statement (dictionary
    (pair (identifier) (number))
    (pair (identifier) (number)))))

=====================================
Dictionary comprehensions
=====================================

{a: b for a, b in items}

---

(module
  (expression_statement (dictionary_comprehension
    (pair (identifier) (identifier))
    (expression_list (identifier) (identifier))
    (identifier))))
