=====================================
Numbers
=====================================

-.6
-1
123.4123
0xDEAD
1j
-1j
123.123J
0o123
0b001

---

(module
  (expression_statement (unary_operator (number)))
  (expression_statement (unary_operator (number)))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (unary_operator (number)))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number)))

=====================================
Scientific Notation
=====================================

1e322
1e-3
1e+3
1.8e10
1.e10
-1e10

---

(module
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (number))
  (expression_statement (unary_operator (number))))

=====================================
Strings
=====================================

"I'm ok"
'"ok"'
r'hi'
ur"bye"
b'sup'

---

(module
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string)))

=====================================
Other primitives
=====================================

True
False
None

---

(module
  (expression_statement (true))
  (expression_statement (false))
  (expression_statement (none)))

=====================================
Concatenated strings
=====================================

"one" "two" "three"

---

(module
  (expression_statement (concatenated_string
    (string)
    (string)
    (string))))

=====================================
Multi-line strings
=====================================

"""
A double quote hello,
without double or single quotes.
"""

"""
A double quote "hello",
with double quotes.
"""

"""
A double quote 'hello',
with single quotes.
"""

'''
A single quote hello,
without double or single quotes.
'''

'''
A single quote 'hello',
with single quotes.
'''

'''
A single quote "hello",
with double quotes.
'''

---

(module
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string)))

=====================================
Lists
=====================================

[a, b, [c, d]]

---

(module
  (expression_statement (list
    (identifier)
    (identifier)
    (list
      (identifier)
      (identifier)))))

=====================================
List comprehensions
=====================================

[a + b for (a, b) in items]
[a for b in c for a in b]

---

(module
  (expression_statement (list_comprehension
    (binary_operator
      (identifier)
      (identifier))
    (variables
      (tuple (identifier) (identifier)))
    (identifier)))
  (expression_statement (list_comprehension
    (identifier)
    (variables (identifier))
    (identifier)
    (variables (identifier))
    (identifier))))

=====================================
Dictionaries
=====================================

{a: 1, b: 2}
{}

---

(module
  (expression_statement (dictionary
    (pair (identifier) (number))
    (pair (identifier) (number))))
  (expression_statement (dictionary)))

=====================================
Dictionary comprehensions
=====================================

{a: b for a, b in items}
{a: b for c in d for e in items}

---

(module
  (expression_statement (dictionary_comprehension
    (identifier)
    (identifier) (variables (identifier) (identifier)) (identifier)))
  (expression_statement (dictionary_comprehension
    (identifier)
    (identifier) (variables (identifier)) (identifier) (variables (identifier)) (identifier))))

=====================================
Sets
=====================================

{a, b, c,}

---

(module
  (expression_statement (set
    (identifier)
    (identifier)
    (identifier))))

=====================================
Set comprehensions
=====================================

{a[b][c] for a, b, c in items}

---

(module
  (expression_statement (set_comprehension
    (subscript (subscript (identifier) (identifier)) (identifier))
    (variables (identifier) (identifier) (identifier))
    (identifier))))

=====================================
Tuples
=====================================

(a, b)
(a, b, c,)

---

(module
  (expression_statement (tuple (identifier) (identifier)))
  (expression_statement (tuple (identifier) (identifier) (identifier))))

=====================================
Generator expression
=====================================

(a[b][c] for a, b, c in items)
dict((a, b) for a, b in d)
(a for b in c for d in e,)

---

(module
  (expression_statement (generator_expression
    (subscript (subscript (identifier) (identifier)) (identifier))
    (variables (identifier) (identifier) (identifier))
    (identifier)))
  (expression_statement (call
    (identifier)
    (generator_expression
      (tuple (identifier) (identifier))
      (variables (identifier) (identifier))
      (identifier))))
  (expression_statement (generator_expression
    (identifier)
    (variables (identifier))
    (identifier)
    (variables (identifier))
    (identifier))))
