=====================================
Strings
=====================================

"I'm ok"
'"ok"'
r'hi'
ur"bye"

---

(module
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string)))

=====================================
Concatenated strings
=====================================

"one" "two" "three"

---

(module
  (expression_statement (concatenated_string
    (string)
    (string)
    (string))))

=====================================
Multi-line strings
=====================================

"""
Hi "hello"
This is documentation
"""

'''
Hello again.
It is me.
'''

---

(module
  (expression_statement (string))
  (expression_statement (string)))

=====================================
Lists
=====================================

[a, b, [c, d]]

---

(module
  (expression_statement (list
    (identifier)
    (identifier)
    (list
      (identifier)
      (identifier)))))

=====================================
List comprehensions
=====================================

[a + b for a, b in items]

---

(module
  (expression_statement (list_comprehension
    (binary_operator
      (identifier)
      (identifier))
    (expression_list
      (identifier)
      (identifier))
    (identifier))))

=====================================
Dictionaries
=====================================

{a: 1, b: 2}
{}

---

(module
  (expression_statement (dictionary
    (pair (identifier) (number))
    (pair (identifier) (number))))
  (expression_statement (dictionary)))

=====================================
Dictionary comprehensions
=====================================

{a: b for a, b in items}

---

(module
  (expression_statement (dictionary_comprehension
    (pair (identifier) (identifier))
    (expression_list (identifier) (identifier))
    (identifier))))

=====================================
Sets
=====================================

{a, b, c,}

---

(module
  (expression_statement (set
    (identifier)
    (identifier)
    (identifier))))

=====================================
Set comprehensions
=====================================

{a[b][c] for a, b, c in items}

---

(module
  (expression_statement (set_comprehension
    (subscript (subscript (identifier) (identifier)) (identifier))
    (expression_list (identifier) (identifier) (identifier))
    (identifier))))

=====================================
Tuples
=====================================

(a, b)
(a, b, c,)

---

(module
  (expression_statement (tuple (identifier) (identifier)))
  (expression_statement (tuple (identifier) (identifier) (identifier))))
